In [2]:
import pandas as pd
a=pd.read_csv('F:\\suryakant notes\\pra1.csv')
a

   ID       Name    Companies      Profit Growth
0    1   Lamtone  IT services   5274553.0    30%
1    2  Strifind      Finance         NaN    20%
2    3       NaN       Health  47689453.0     7%
3    4       NaN  IT services  23562549.0    NaN
4    5      Mark   Insurances   4563782.0    26%

a.groupby(['Name','

In [3]:
a.groupby(['Name','Growth']).groups

{('Lamtone', '30%'): [0], ('Mark', '26%'): [4], ('Strifind', '20%'): [1], (nan, '7%'): [2], (nan, nan): [3]}

In [4]:
for Companies,k in a:
    print(Companies)
    print(k)

ValueError: too many values to unpack (expected 2)

In [5]:
k=a.groupby('Companies').get_group('IT services')
k

   ID      Name    Companies      Profit Growth
0    1  Lamtone  IT services   5274553.0    30%
3    4      NaN  IT services  23562549.0    NaN

In [6]:
k.agg(['sum','max','mean'])

      ID                Companies      Profit
sum   5.0  IT servicesIT services  28837102.0
max   4.0             IT services  23562549.0
mean  2.5                     NaN  14418551.0